Documents/ПередачаНаКомиссию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>ПередачаНаКомиссию</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТовара</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаКомиссии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладКомиссии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаЗакупкиСЗатратами</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаКомитента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>19</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПередачаНаКомиссию/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ДействияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИмяДокумента = Объект.Ссылка.Метаданные().Синоним;  
	
	Элементы.ГруппаСостояние.Видимость = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("ОтображатьСостояниеВФормеДокумента");
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 

 	Элементы.Валюта.БыстрыйВыбор = ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("БыстрыйВыборВалют"); 
    ЗаполнитьКэшДанных();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	клФормаДокументаПриОткрытии(ЭтаФорма, Объект);
	
	РаботаСоСканеромШК.СканерШКПодключить();  
	ОтобразитьЦветВалюты();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)

	клФормаДокументаПередЗаписью(Объект, Отказ);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	ОбщегоНазначения.ОтобразитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента); 
	
КонецПроцедуры

 &НаСервере
 Процедура ЗаполнитьКэшДанных()
	 
	 КэшДанных = Новый Структура;
	 КэшДанных.Вставить("РаскрашиватьВалюты", ОбщегоНазначенияПовтИсп.ПолучитьЗначениеНастройки("РаскрашиватьВалюты"));
	 КэшДанных.Вставить("ЦветаВалют", ОбщегоНазначенияПовтИсп.ЦветаВалют());
	 
 КонецПроцедуры 
 
#КонецОбласти 


#Область ДействияЭлементовФормы

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)

	ОтобразитьЦветВалюты();

КонецПроцедуры
 
 &НаКлиенте
Процедура ОтобразитьЦветВалюты() 
	
	Если КэшДанных.РаскрашиватьВалюты Тогда
		Элементы.Валюта.ЦветФона = КэшДанных.ЦветаВалют.Получить(Объект.Валюта);
	КонецЕсли;
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)
	
	ЛюбаяСерия(РучнойШК, Истина);

КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьИтоги()

	СтруктураИтогов = омСервер.МоиИтогиФорматированные(Объект); 
	Элементы.ДекорацияИтого.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(СтруктураИтогов.Итоги));

КонецПроцедуры

#КонецОбласти 


#Область РаботаСоШтрихкодом

&НаКлиенте
Процедура ЛюбаяСерия(ШК, СтатьНаРучной = Ложь) 
	
	Если ЭтаФорма.ТолькоПросмотр Тогда Возврат КонецЕсли; 
	//Если Объект.Окончательно Тогда Возврат КонецЕсли; 
	
	//МоиИтоги(Объект.Товары.Количество()-1);
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	Если гоПЗ(Объект.Склад) Тогда клОшибка("Не задан склад ОТКУДА!"); Возврат; КонецЕсли; 
	Если гоПЗ(Объект.Валюта) Тогда клОшибка("Не задана валюта!"); Возврат; КонецЕсли; 
	
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	//по идее, нужно найти товар с такой серией и передать его в добавление строки, зачем изобретать велосипед?
	СпиПар = омСервер.ПартииПоСерииОстатки(ШК, Объект.Фирма, Объект.Склад);
	
	Ско = СпиПар.Количество();
	ТекПар = 0;
	Если Ско  = 0 Тогда
		Сигнал();
		клОшибка("Нет остатков по серии: " + ШК + "!");
		Возврат;
	ИначеЕсли Ско > 1 Тогда
		Сигнал();
		Эле = СпиПар.ВыбратьЭлемент("Найдено несколько партий с такой серией, выберите:");
		Если Эле = Неопределено Тогда Возврат КонецЕсли;
		ТекПар = Эле.Значение;
	Иначе
		ТекПар = СпиПар[0].Значение;
	КонецЕсли; 
	Если ТекПар = 0 Тогда Возврат КонецЕсли; 
	
	НовКол = 1;
	НовНом = гоРеквизит(ТекПар, "Владелец");
	
	НовСтр = Объект.Товары.Добавить();
	
	НовСтр.Номенклатура = НовНом;
	НовСтр.Партия = ТекПар;
	НовСтр.Количество = НовКол;
	
	ИДИ = НовСтр.ПолучитьИдентификатор();
	
	//МояЗаписать(Ложь);
	
	//гоЗаписьЖурналаРегистрации(ШК + "|" + Строка(НовКол) + "|" + гоИмя(НовНом, Ложь), ИмяДокумента + ?(Объект.Окончательно, "ПослеОкончательно", ""), "Добавление строки", Объект.Ссылка, 2);
	
	Элементы.Товары.ТекущаяСтрока = ИДИ;
	
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура МоеОжидание()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзБуфераОбмена(Команда)

	//Если ЭтаФорма.ТолькоПросмотр ИЛИ Объект.Окончательно Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//МоиИтоги();
	//Если НЕ (стрОплата = "") Тогда Возврат КонецЕсли; 
	
	//Если гоПЗ(Объект.Склад) Тогда клОшибка(НСтр("ru = 'Не задан склад!'; en = 'Store not specified!'")); Возврат; КонецЕсли; 
	//Если гоПЗ(Объект.Валюта) Тогда клОшибка(НСтр("ru = 'Не задана валюта!'; en = 'Currency not specified!'")); Возврат; КонецЕсли; 
	//
	//Если гоПЗ(Объект.Ссылка) Тогда МояЗаписать(Ложь) КонецЕсли; 
	
	Буф = РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера();
	
	//если уже есть такой товар, зачем искать цену
	Если Объект.Товары.Количество() > 0 Тогда
		ЕстЦен = 0;
		Мас = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", НовНом));
		Если Мас.Количество() > 0 Тогда ЕстЦен = Мас[0].ЦенаПродажи КонецЕсли;
	КонецЕсли; 
	
	////2016.04.23
	//Если ЕстЦен <> 0 Тогда 
	//	НовЦен = ЕстЦен;
	//Иначе 
	//	НовЦен = 0;
	//	Если НЕ ВвестиЧисло(НовЦен, "Цена (0 - взять цены прихода)", 19, ЧислоЗнаковЦена) Тогда Возврат КонецЕсли;
	//КонецЕсли;
	
	НСтр = СтрЧислоСтрок(Буф);
	
	//тут должна быть одна колонка, после получения первого непустого значения (могут быть табуляции) - больше не ищем
	Для Н = 1 По НСтр Цикл
		СС = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (СС = "") И (С <> "") Цикл
			СС = гоСледПолеТаб(С);
		КонецЦикла; 
		ЛюбаяСерия(СС);
	КонецЦикла;  
	
КонецПроцедуры



#КонецОбласти              


#Область ДействияТабличнойЧасти

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	
	ОтобразитьИтоги();

КонецПроцедуры


&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	ОтобразитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	// 1. Отключаем предыдущий вызов, чтобы они не накапливались при быстром скроллинге
    ОтключитьОбработчикОжидания("ОбновитьИнфоСтрокуАсинхронно");
    
    // 2. Подключаем обработчик однократно с задержкой 0.2 секунды
    ПодключитьОбработчикОжидания("ОбновитьИнфоСтрокуАсинхронно", 0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИнфоСтрокуАсинхронно()
    
    ТекДанные = Элементы.Товары.ТекущиеДанные;
    
    Если ТекДанные = Неопределено Тогда 
        Элементы.ДекорацияИнфоСтроки.Заголовок = "";
        Возврат;
    КонецЕсли;
    
    Ит = 0;
    НайдСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", ТекДанные.Номенклатура));
    Для каждого НайдСтрока Из НайдСтроки Цикл
        Ит = Ит + НайдСтрока.Количество;
    КонецЦикла;
    
    Если Ит > 0 Тогда
        Стр = СтрШаблон("%1: %2", 
                        НСтр("ru = 'Количество товара текущей строки'; en = 'Quantity of the current line good'"),
                        омСервер.Фрмт(Ит, "ЧИСЛОЦЕЛ_ЦВ1"));
                        
        Элементы.ДекорацияИнфоСтроки.Заголовок = Новый ФорматированнаяСтрока(ОбщегоНазначения.ТекстHTMLВФорматированнуюСтроку(Стр));                
    Иначе
        Элементы.ДекорацияИнфоСтроки.Заголовок = "";
    КонецЕсли;    
    
КонецПроцедуры  

#КонецОбласти
